label D1M_PROLOG:
    scene PROLOG_OCEAN 
    play music "music/neheart_-_snowfall_75941790.mp3"
    author "{glitch}{sc}Что есть жизнь?{/sc}{/glitch}"
    author "Жизнь - это дар, что бы познавать себя и знать, как сотворить прекрасное для своей души, которая способна жить, перемещаясь в любые измерения..."
    author "{glitch=10}{sc=10}...ГДЕ ЕСТЬ ЖИЗНЬ{/sc}{/glitch}"
    author "А душа - это что?"
    author "Это вы и есть внутри себя. Человек думает и чувствует внутри себя таким, какой он есть, но выразить это словами не может..."
    author "...боится что его не поймут другие. "
    author '"Сотворить прекрасное для своей души" - имеется в виду, что если будет счастлива душа, то будет счастлив и человек в целом, а будет счастлив человек, то он, естественным образом, будет делиться этим счастьем с окружающими'
    author 'Будет меняться энергия на земле, исчезнет "война". Будет разум человека думать, как продлить свою жизнь, чтобы она стала безмерной и ею наслаждаться в полном понимании этого слова.'
    author "А распределяется и делиться энергия на сегодняшний день в окружающих от чувств страха, войны, которые выделяет человек."
    author "Например, в автобусе кто-то с кем-то ругается, выделяя чувство ненависти и злости, а все этой руганью заражаются."
    author 'Поэтому человеку нужно учиться жить ради жизни, а не ради "смотреть смерти в лицо".'
    author 'А для этого нужно познать самого себя - понять "тайны человеческих чувств", которые мешают сотворить "реальный мир для жизни" в своём внутреннем мире'
    author "А начиная познавать самого себя, у человека возникнет желание освободить свою душу от негативных воинствующих чувств, несущих разрушение, болезни и неудовлетворение собственной жизнью."
    author "А что такое судьба? И существует ли она?"
    author "Есть мнение, что человек не может изменить свою судьбу? Это правда!"
    author "Судьба не поддается влиянию и изменению. Вопрос в том предначертана ли судьба?"
    author "Ведь если бы это было так, то по факту мы с вами становимся марионетками в чей-то большой игре под названием судьба."
    author "Это как определенный сценарий, в котором нам как читателям все известно."
    author "Но..."
    stop music 
    play bgs "sounds/alarm-clock-beep-1_zjgin-vd.mp3"
    show BLACK_SCREEN 
    author "..."
    author "..."
    author "..."
    author "...Что?"
    window hide
    show OBSHAGA with opened
    with dissolve
    stop bgs
    play music "music/Мышь - Жвачка.mp3" fadein(2.0)
    window hide
    pause
    window show
    "Ой-ой-ой моя голова..."    
    "8 Утра... ?"
    window hide
    pause
    window show
    "...Понедельник..."
    "...Так..."
    with hpunch
    "Твою мать!{w} У меня же сегодня учеба!"
    "Щас еще опоздаю и буду отчислен еще даже не придя ни на одну пару..."
    "БЕГОМ"
    "Стас взял пропуск и вышел из общаги"
    hide OBSHAGA
    show NA_ULIZE
    with dissolve
    stop music
    play bgs "sounds/zvuki-na-ulice-goroda.mp3"
    s "Быстрей, быстрей, идем на взлет!"
    s "Так 1 корпус..."
    s "..."
    s "Ага! Аудитория 384"
    s "Ну с Богом"
    stop bgs
    hide NA_ULIZE
    show BLACK_SCREEN
    with dissolve
    s "Так-с...{w} Ну что же...{w} Хех"
    hide BLACK_SCREEN
    show PROLOG_OCEAN
    with dissolve
    play music "music/neheart_Reidenshi_-_distorted_memories_75718831.mp3"
    s "Всем привет! Как вы поняли меня зовут Стас{w} и это моя история"
    s "Недавно мне стукнуло 19 лет, так что родители сказали: либо ты учишься либо идешь в армию"
    s "Меня 2 вариант не устроил..."
    s "И по этой причине я сейчас здесь{w} в Донском Государственном Техническом Университете"
    s "Но я бы хотел начать с начала..."
    s "Я решил попробовать свои силы в рамках новой образовательной программы под названием: \"Школа X\""
    s "И вроде по началу мне даже нравилось:{w} я ходил на пары, работал в команде, да и товарищи были рядом..."
    s "Но что-то не то..."
    s "..."
    s "Не клеилась моя учёба на 1 курсе"
    s "По этой причине у меня возникло желание перевестись на другое направление"
    s "И в один момент я решился поговорить со своим деканом.."
    stop music
    show KABINET_DEKANA
    play sound "sounds/stuk-v-dver-kostyashkami-paltsev.mp3"
    s "Иван Васильич можно?"
    show IVAN_VASILIICH
    with dissolve
    i "Проходи, присаживайся"
    s "Иван Васильич, у меня к вам есть разговор"
    i "В чем дело?"
    s "Я{w} хочу перевестись..."
    i "Почему?{w} Тебя что-то не устраивает?"
    s "Ну нет, но...{w} В общем да меня не устраивает мое текущее положение"
    i "Есть ли какая-то веская причина твоего решения?"
    s "Иван Васильевич, сейчас у меня сложный период в жизни"
    i "Может быть я могу чем-то помочь? У меня есть знакомый психолог хороший, можешь ему высказаться, тебе полегчает"
    s "Нет, простите со мной все в порядке{w}, меня просто...."
    s "...напрягает что на меня давят родители{w} и сейчас..."
    s "...и сейчас я в сложной жизненной ситуации{w}, пожалуйста войдите в мое положение, прошу вас..."
    i "А родители в курсе всей ситуации?"
    s "Я...я не думаю что им будет интересно это"
    i "..."
    s "..."
    i "Кхм{w}, Кхм так ну что же..."
    i "Станислав, ты уверен, что принял взвешенное решение? Все-таки обратного пути может уже и не быть"
    s "Иван Васильич, уверяю вас я уже долгое время думаю об этом..."
    s "...и каждый день эта мысль прокручивается в моей голове, словно кинопленка"
    i "Эх...{w} Станислав, ты хорошо учишься так что я сделаю исключение для тебя"
    s "Спасибо!{w}Спасибо!{w}Иван Васильич, я вам так благодарен!"
    i "Иди, я подготовлю документы"
    s "Хорошо, еще раз спасибо вам"
    hide IVAN_VASILIICH
    hide KABINET_DEKANA
    show PROLOG_OCEAN
    with dissolve
    # with Pixellate(1, 3) - потестил вроде неплохой такой переход пиксельный (1 число это время а 2 число это шаг)
    play music "music/neheart_Reidenshi_-_distorted_memories_75718831.mp3"
    s "Пройдя через бюрократический ад, я наконец-то смог оказаться в группе под названием ВПР24"
    s "Факультет ИиВТ, кафедра ПОВТиАС"
    s "Не знаю верный ли был это выбор, но..."
    s "...уже выбора точно нет"
    s "Так что вперед и с песней!"
    s "Надеюсь, что со второго раза мне повезет!"
    author "А может и нет)"
    hide PROLOG_OCEAN
    stop music
    show NA_ULIZE
    with dissolve
    play bgs "sounds/zvuki-na-ulice-goroda.mp3"
    s "Черт, надо спешить"
    s "Опаздываю"
    stop bgs
    show DGTU_BG_INSIDE
    with dissolve
    play bgs "sounds/turniket.mp3"
    s "Так пропуск, где же ты"
    s "Ага нашел!"
    s "Давай же долбанный турникет!"
    s "Есть!"
    s "3 этаж..."
    stop bgs
    play sound "sounds/dgtu_zvon.mp3"
    s "Твою мать! Быстрее! На первую же пару опаздывать..."
    show PARA_L
    with fade
    s "Так! Это вроде тут..."
    s "Заходим"
    stop sound
    jump D1M_DGTU_OUTSIDE
    jump DGTU_OUTSIDE

label D1M_DGTU_OUTSIDE:
    play bgs "sounds/zvuki-na-ulice-goroda.mp3"
    scene DGTU_BG_OUTSIDE
    show BLACK_SCREEN
    with dissolve
    "Тем временем..."
    hide BLACK_SCREEN
    with dissolve
    g "Боря быстрей, если сейчас опоздаем, нас Поркш убьёт!"
    show GOGA_OUTSIDE at left2
    show BORYA_OUTSIDE at right2
    with dissolve
    b "Да иду я уже"
    g "О Ванек здарова"
    show GOGA_OUTSIDE at left
    show BORYA_OUTSIDE at right
    with move
    show DIVAN_SMILE at center
    with dissolve
    d "Здарова! Че вы тут стоите?"
    g "Как-никак тебя ждем"
    d "А пара скоро?"
    b "Да вот через..."
    d "Да пофиг, я курить. {w}Если что я опоздаю!"
    b "Ага, пофиг!{w} У тебя мало того что долг, так еще и посещаемость решил \"исправить\"?"
    g "Вот именно! Tак что никаких курить." 
    g "Пойдем. У нас теорвер"
    d "Ладно..."
    d "На ковер к Поркшу не особо хочется..."
    hide DIVAN_SMILE
    hide NIKITA_OUTSIDE
    show NIKITA_OUTSIDE at left2
    with dissolve
    n "Всем здарова челики! A че вы не на паре?"
    n "Идем, а то опоздаем"
    show ZHENYA_OUTSIDE at right2
    with dissolve
    z "Я уже устал 60 заказов в день выполнять, сдохну скоро"
    z "Староста пойдем уже"
    hide DIVAN_SMILE
    show ARINA_OUTSIDE at center
    with dissolve
    a "Да задолбали{w}, НЕ НАЗЫВАЙТЕ МЕНЯ СТАРОСТОЙ!"
    stop music fadeout(2.0)
    stop bgs fadeout(2.0)
    hide NIKITA_OUTSIDE
    hide BORYA_OUTSIDE
    hide ZHENYA_OUTSIDE
    hide ARINA_OUTSIDE
    show GOGA_OUTSIDE at center
    with dissolve
    g "Я думаю нам пора"
    g "Пойдем!"
    jump D1M_IN_DGTU

label D1M_IN_DGTU:
    scene DGTU_BG_INSIDE
    play bgs "sounds/turniket.mp3"
    show BORYA_OUTSIDE
    with dissolve
    b "Ух, мы внутри"
    b "По-моему в прошлом году тут был другой охранник"
    hide BORYA_OUTSIDE
    show GOGA_OUTSIDE
    with dissolve
    g "Ага, Ага, это очень своевременная информация, лучше давай быстрей, а то опоздаем на пару"
    stop bgs fadeout(2.0)
    play sound "sounds/dgtu_zvon.mp3"
    hide GOGA_OUTSIDE
    show ZHENYA_OUTSIDE
    with dissolve
    z "Погодите! Я карту найти не могу. Где же она?"
    # Спрайт Арины
    a "Да пошли уже задолбал!"
    stop sound fadeout(3.0)
    jump D1P1
    